{
  "title": "Birthday Letter For Suzy",
  "cells": [
    {
      "type": "text",
      "data": "嘿，肥兔！<div>想来想去放弃了买信纸拿笔写的可能，主要脑子转的比写下的字要快，写着写着就会忘记想说啥了。</div><div>生日快乐呀，越来越觉得时间飞奔向前，感觉即使是意料之内的21岁，也还是来的有点突然。估计接下来一年会是很重要的一个时期，渡过了浑浑噩噩脑袋不清晰的一段迷茫期，我想此时此刻的你应该也觉得内心的目标的越来越清楚了吧。我觉得未来真的是会变得愈发明确的吧。我是一个特别容易受别人影响的人，而且很多时候会选择不去知道我不想知道的事实。从第一次认识你到现在，我都觉得你身上有一些特质——去面对的勇气（在我看来特别明显）和面对大小挫折之后很快恢复的能力，真的是很让我羡慕呢。我想这样子的人一定是可以非常高效率的提高自己的，可以一路向前去达到你的目的的。所以，要祝你接下来一年里，research可以有一个好的结果，写漂亮的代码，申请到合适的学校。</div><div>周一和wfz聊天，他的一句“<span style=\"font-family: &quot;Helvetica Neue&quot;;\">你和郑苏晨做了这么久朋友你没有从她那里学到点东西嘛”，真算是对我的叩问了哈哈哈。我一定能算是非常非常固执的人了hhhh，很多的事情看在眼里，但因为自己那个莫名其妙的小个性，不愿意学。我每次和麻麻说日常的时候，她也会经常说你要多向郑苏晨学习。我不知道这两年半里，你于我到底有多大的影响。但是每次看到你对所有人都很友好善良的时候，真的会有在想我要是能成为这样的人就好了呐。之前，你说你觉得自己太软弱，想要更坚强一点，但又不要太坚强。可是，这个世界上能够显露出软弱的人真是越来越少了，这个世界上因为别人而软弱的人也越来越少了。嘛，从我个人看来，祝你接下来一年能离那个想成为的样子近一点辣。</span></div><div><font face=\"Helvetica Neue\">结果还是拖到了周五凌晨，唉，怎么办呢，代码马上就要完全替代掉你在我心里的位置了哈哈哈。忘记说了，谢谢你的暖风机，真是太有用了，睡了两个温暖的好觉。有一天五点就醒了，去洗了个澡，完了就头疼睡不着，就打开暖风机吹了一会就困了。</font></div><div><font face=\"Helvetica Neue\">你之前说想要音响，我和你说等我有钱了就给你买。现在钱不多哈哈哈，挑来挑去能够支付的价格里感觉这个还行，就当未来音响的过渡吧，至少长得还算好看吧。</font></div><div><font face=\"Helvetica Neue\">我经常会觉得周围的人都像个孩子一样，有好多我想都不会想的“幼稚”的看法，一边会不屑（笑）这些看法，一边又很羡慕，感觉在很多事情上自己是个实实在在的功利主义者。想说的其实是，我一直在你身上看到那些所谓的“幼稚”，让我这么悲观的人也觉得好像世界其实比我预计的要美好很多（事实也确实如此）。在另一方面，虽然之前年底的时候和你聊天，你说自己没有什么长进，我倒觉得，有看到你在处理事情上更加现实全面呢，只不过这种变化是自己和他人都很难察觉到的事情罢了。</font></div><div><font face=\"Helvetica Neue\">最近时不时的会想到现在已经大三下了，年底开始申请，明年就毕业，这种强烈的真实感，以及我对这个现实强烈的抗拒，让我感觉，能够在一起的时间真的不多了。大三这一年真的是忙忙碌碌，转眼就结束了。现在的我想到在将来的某个可以预见的日子里，我们，不仅仅是我和你，要分别了，这一点足够让我心疼了。我一直觉得再深再深的感情都是很难跨越时间空间的，所以更想要过好现在的每一刻。所以希望接下来不长不短的日子里，我们还可以一直互相支持着，走下去。</font></div><div><font face=\"Helvetica Neue\">诶，真是一年偶尔几次会把一肚子曾经想过的事情说出来。好好的欢乐的生日祝福大概是被我毁了。还原一下快乐的气氛吧，最后，祝肥兔越来越肥shou，祝肥兔能找到很爱肥兔的人，祝肥兔在21岁里每一天都有一些些小小的开心，祝肥兔顺利的跨越所有的挫折和困难，祝肥兔今日和以后想要做到事情都可以一步一步脚踏实地的完成。</font></div><div><font face=\"Helvetica Neue\">没完没完，常规结尾，送给你一句话吧。希望每个人的二十几岁，都是扛着剑走在江湖的生活，日子要像分明的四季，抓一把路边的花生闲逛着走，每一关遇到的同伴和怪兽都珍惜。</font></div><div><font face=\"Helvetica Neue\">就这样啦，希望你不介意这个电子版的生日祝福哈哈哈哈。（你介意也没有办法了，摊手）</font></div><div><font face=\"Helvetica Neue\"><br></font></div><div><font face=\"Helvetica Neue\">爱你的大橘猫</font></div>"
    }
  ]
}