{
  "title": "Difficult Sentence",
  "cells": [
    {
      "type": "markdown",
      "data": "> Those who fear the influence of television deliberately underplay its persuasive power, hoping that they might keep knowledge of its potential to effect social change from being widely disseminated.\n\n> The poet W. H. Auden believed that the greatest poets of his age were almost necessarily irresponsible, that the possession of great gifts engenders the propensity to abuse them.\n\n> Within the next decade, sophisticated telescopes now orbiting the Earth will determine whether the continents really are moving, forestalling the incipient rift among geologists about the validity of the theory of continental drift.\n\n> While she initially suffered the fate of many pioneers—the incomprehension of her colleagues—octogenarian Nobel laureate Barbara McClintock has lived to savor the triumph of her once heterodox scientific theories.\n\n> Having no sense of moral obligation, Shipler was as little subject to the reproaches of conscience after he acted as he was motivated by its promptings before he acted.\n\n> Rhetoric often seems to triumph over reason in a heated debate, with both sides engaging in hyperbole.\n\n> As the creation of new knowledge through science has become institutionalized resistance to innovation has become less aggressive taking the form of inertia rather than direct attack.\n\n> An analysis of the ideas in the novel compels an analysis of the form of the work, particularly when form and content are as  integrated as they are in The House of the Seven Gables.\n\n> Because the order in which the parts of speech appear in the sentences of a given language is decided merely by custom, it is unjustifiable to maintain that every departure from that order constitutes a violation of a natural law.\n\n> Actual events in the history of life on Earth are accidental in that any outcome embodies just one possibility among millions; yet each outcome can be rationally interpreted."
    }
  ]
}